dev/Testing/SAHL.Testing.Services/SAHL.Testing.ComcorpServices.Tests/XML/WhenApplicantDetailsDifferAndOpenAccExists.xml

<s:Envelope xmlns:s="http://schemas.xmlsoap.org/soap/envelope/">
  <s:Header>
    <To xmlns="http://schemas.microsoft.com/ws/2005/05/addressing/none" s:mustUnderstand="1">http://comcorp.sahomeloans.com/ComcorpConnectorService/SAHLIntegrationService.svc/integration</To>
    <Action xmlns="http://schemas.microsoft.com/ws/2005/05/addressing/none" s:mustUnderstand="1">http://tempuri.org/ISAHLIntegrationService/Submit</Action>
  </s:Header>
  <s:Body>
    <SAHLRequest xmlns="http://tempuri.org/">
      <Application xmlns:a="http://schemas.datacontract.org/2004/07/SAHL.WCFServices.ComcorpConnector.Objects" xmlns:i="http://www.w3.org/2001/XMLSchema-instance">
        <a:ApplicationCode>6451388911</a:ApplicationCode>
        <a:CapitaliseFees>false</a:CapitaliseFees>
        <a:CashOutAmt>0</a:CashOutAmt>
        <a:CashOutReason />
        <a:CoApplicants />
        <a:ConsultantFirstName>Nicole</a:ConsultantFirstName>
        <a:ConsultantSurname>Olivier</a:ConsultantSurname>
        <a:DepositCash>10</a:DepositCash>
        <a:DepositOther />
        <a:DepositSource>false</a:DepositSource>
        <a:EstCostFees>0</a:EstCostFees>
        <a:HigherBond>0</a:HigherBond>
        <a:InstalmentMethod>Debit Order</a:InstalmentMethod>
        <a:LoanAmountRequired>1750000</a:LoanAmountRequired>
        <a:MainApplicant>
          <a:AddressCityWork>BENONI</a:AddressCityWork>
          <a:AddressLine1Work>59 INDOBALI</a:AddressLine1Work>
          <a:AddressSuburbWork>59 INDOBALI</a:AddressSuburbWork>
          <a:AdminRescinded>0001-01-01T00:00:00</a:AdminRescinded>
          <a:AssetItems>
            <a:AssetItem>
              <a:AssetCompanyName />
              <a:AssetDescription />
              <a:AssetOutstandingLiability>100000</a:AssetOutstandingLiability>
              <a:AssetPhysicalAddressCity>MORNING STAR</a:AssetPhysicalAddressCity>
              <a:AssetPhysicalAddressCode>2001</a:AssetPhysicalAddressCode>
              <a:AssetPhysicalAddressLine1>45 EEREE</a:AssetPhysicalAddressLine1>
              <a:AssetPhysicalAddressLine2>WERWEWR</a:AssetPhysicalAddressLine2>
              <a:AssetPhysicalAddressSuburb>MORNING STAR</a:AssetPhysicalAddressSuburb>
              <a:AssetPhysicalCountry />
              <a:AssetPhysicalProvince>WESTERN CAPE</a:AssetPhysicalProvince>
              <a:DateAssetAcquired>2014-06-03T00:00:00</a:DateAssetAcquired>
              <a:SAHLAssetDesc>FIXED PROPERTY</a:SAHLAssetDesc>
              <a:SAHLAssetValue>50000</a:SAHLAssetValue>
            </a:AssetItem>
          </a:AssetItems>
          <a:BankAccounts>
            <a:BankAccount>
              <a:AccountBranch>632005 - ABSA ELECTRONIC SETTLEMENT CNT</a:AccountBranch>
              <a:AccountInstitution>ABSA</a:AccountInstitution>
              <a:AccountName>Mr PW Strydom and Mr SF Mulder and Mrs SB Strydom</a:AccountName>
              <a:AccountNumber>4041662162</a:AccountNumber>
              <a:AccountType>Current</a:AccountType>
              <a:IsBusinessAccount>false</a:IsBusinessAccount>
              <a:STDAccountBranchCode>632005</a:STDAccountBranchCode>
              <a:isMainAccount>true</a:isMainAccount>
            </a:BankAccount>
          </a:BankAccounts>
          <a:BusinessMember>false</a:BusinessMember>
          <a:Cellphone>0722272780</a:Cellphone>
          <a:CorrespondenceLanguage>Afrikaans</a:CorrespondenceLanguage>
          <a:CurrentEmploymentType>Salaried</a:CurrentEmploymentType>
          <a:DateJoinedEmployer>2013-01-04T00:00:00</a:DateJoinedEmployer>
          <a:DateOfBirth>1980-02-20T00:00:00</a:DateOfBirth>
          <a:DateRehabilitated>0001-01-01T00:00:00</a:DateRehabilitated>
          <a:DateSalaryPaid>1</a:DateSalaryPaid>
          <a:DebtRearrangement>false</a:DebtRearrangement>
          <a:DeclaredInsolvent>false</a:DeclaredInsolvent>
          <a:EmailAddress>smulder@icza.co.za</a:EmailAddress>
          <a:EmployeeMedicalAid>2000</a:EmployeeMedicalAid>
          <a:EmployeeNo />
          <a:EmployeePAYE>0</a:EmployeePAYE>
          <a:EmployeePension>0</a:EmployeePension>
          <a:EmployeeUIF>0</a:EmployeeUIF>
          <a:EmployerBusinessType>Company</a:EmployerBusinessType>
          <a:EmployerEmail />
          <a:EmployerGrossMonthlySalary>23166.26</a:EmployerGrossMonthlySalary>
          <a:EmployerName>Imperial Commercial</a:EmployerName>
          <a:EmployerRemunerationType>Salaried</a:EmployerRemunerationType>
          <a:EmploymentSector>Transportation</a:EmploymentSector>
          <a:EthnicGroup>Coloured</a:EthnicGroup>
          <a:ExpenditureItems>
            <a:ExpenditureItem>
              <a:CapturedDescription />
              <a:ExpenditureAmount>5000</a:ExpenditureAmount>
              <a:ExpenditureDesc>Bond Payments</a:ExpenditureDesc>
              <a:ExpenditureType>1</a:ExpenditureType>
            </a:ExpenditureItem>
            <a:ExpenditureItem>
              <a:CapturedDescription />
              <a:ExpenditureAmount>1000</a:ExpenditureAmount>
              <a:ExpenditureDesc>Rates and taxes</a:ExpenditureDesc>
              <a:ExpenditureType>2</a:ExpenditureType>
            </a:ExpenditureItem>
            <a:ExpenditureItem>
              <a:CapturedDescription />
              <a:ExpenditureAmount>2500</a:ExpenditureAmount>
              <a:ExpenditureDesc>Water, lights, refuse removal</a:ExpenditureDesc>
              <a:ExpenditureType>3</a:ExpenditureType>
            </a:ExpenditureItem>
            <a:ExpenditureItem>
              <a:CapturedDescription />
              <a:ExpenditureAmount>2000</a:ExpenditureAmount>
              <a:ExpenditureDesc>Food and groceries</a:ExpenditureDesc>
              <a:ExpenditureType>11</a:ExpenditureType>
            </a:ExpenditureItem>
            <a:ExpenditureItem>
              <a:CapturedDescription />
              <a:ExpenditureAmount>500</a:ExpenditureAmount>
              <a:ExpenditureDesc>Clothing</a:ExpenditureDesc>
              <a:ExpenditureType>12</a:ExpenditureType>
            </a:ExpenditureItem>
            <a:ExpenditureItem>
              <a:CapturedDescription />
              <a:ExpenditureAmount>2000</a:ExpenditureAmount>
              <a:ExpenditureDesc>Domestic worker wage/garden services</a:ExpenditureDesc>
              <a:ExpenditureType>14</a:ExpenditureType>
            </a:ExpenditureItem>
            <a:ExpenditureItem>
              <a:CapturedDescription />
              <a:ExpenditureAmount>1000</a:ExpenditureAmount>
              <a:ExpenditureDesc>Education fees</a:ExpenditureDesc>
              <a:ExpenditureType>15</a:ExpenditureType>
            </a:ExpenditureItem>
            <a:ExpenditureItem>
              <a:CapturedDescription />
              <a:ExpenditureAmount>100</a:ExpenditureAmount>
              <a:ExpenditureDesc>Rental repayment</a:ExpenditureDesc>
              <a:ExpenditureType>18</a:ExpenditureType>
            </a:ExpenditureItem>
            <a:ExpenditureItem>
              <a:CapturedDescription />
              <a:ExpenditureAmount>2000</a:ExpenditureAmount>
              <a:ExpenditureDesc>Medical expenses</a:ExpenditureDesc>
              <a:ExpenditureType>24</a:ExpenditureType>
            </a:ExpenditureItem>
          </a:ExpenditureItems>
          <a:FaxCode></a:FaxCode>
          <a:FaxNo></a:FaxNo>
          <a:FirstName>Gerhardus Wilhelmus Albertus Marcus</a:FirstName>
          <a:Gender>MALE</a:Gender>
          <a:HomeLanguage>Afrikaans</a:HomeLanguage>
          <a:HomePhone></a:HomePhone>
          <a:HomePhoneCode></a:HomePhoneCode>
          <a:IdentificationNo>8002205019084</a:IdentificationNo>
          <a:IncomeContributor>true</a:IncomeContributor>
          <a:IncomeItems>
            <a:IncomeItem>
              <a:CapturedDescription />
              <a:IncomeAmount>20000</a:IncomeAmount>
              <a:IncomeDesc>Basic Salary</a:IncomeDesc>
              <a:IncomeType>22</a:IncomeType>
            </a:IncomeItem>
          </a:IncomeItems>
          <a:IsUnderAdminOrder>false</a:IsUnderAdminOrder>
          <a:IsUnderDebtReview>false</a:IsUnderDebtReview>
          <a:JudgementIndicator>false</a:JudgementIndicator>
          <a:JudgementValue />
          <a:LiabilityItems>
            <a:LiabilityItem>
              <a:LiabilityAssetValue>0</a:LiabilityAssetValue>
              <a:LiabilityCompanyName>CLINT TEST CO</a:LiabilityCompanyName>
              <a:LiabilityDateRepayable>0001-01-01T00:00:00</a:LiabilityDateRepayable>
              <a:LiabilityDescription>FIXED LONG TERM INVESTMENT</a:LiabilityDescription>
              <a:LiabilityLoanType />
              <a:LiabilityOutstandingLiability>0</a:LiabilityOutstandingLiability>
              <a:SAHLLiabilityCost>0</a:SAHLLiabilityCost>
              <a:SAHLLiabilityDesc>FIXED LONG TERM INVESTMENT</a:SAHLLiabilityDesc>
              <a:SAHLLiabilityValue>500000</a:SAHLLiabilityValue>
            </a:LiabilityItem>
          </a:LiabilityItems>
          <a:MaritalStatus>Single</a:MaritalStatus>
          <a:MarketingConsumerLists>true</a:MarketingConsumerLists>
          <a:MarketingEmail>false</a:MarketingEmail>
          <a:MarketingFlyer>false</a:MarketingFlyer>
          <a:MarketingMagazine>false</a:MarketingMagazine>
          <a:MarketingMarketing>false</a:MarketingMarketing>
          <a:MarketingNewspaper>false</a:MarketingNewspaper>
          <a:MarketingOnline>false</a:MarketingOnline>
          <a:MarketingOther>false</a:MarketingOther>
          <a:MarketingRadio>false</a:MarketingRadio>
          <a:MarketingReferral>false</a:MarketingReferral>
          <a:MarketingSMS>false</a:MarketingSMS>
          <a:MarketingTV>false</a:MarketingTV>
          <a:MarketingTelemarketing>false</a:MarketingTelemarketing>
          <a:MarriedStatus>ANC WITH ACCRUAL</a:MarriedStatus>
          <a:MayDoCreditBureauEnquiry>true</a:MayDoCreditBureauEnquiry>
          <a:MemberCompanyName />
          <a:MemberCompanyNumber />
          <a:NetAssets />
          <a:Occupation>EMPLOYED</a:Occupation>
          <a:PassportNo>293828938237</a:PassportNo>
          <a:PermanentResident>true</a:PermanentResident>
          <a:PhysicalAddressCity>Port Elizabeth</a:PhysicalAddressCity>
          <a:PhysicalAddressCode>6070</a:PhysicalAddressCode>
          <a:PhysicalAddressLine1></a:PhysicalAddressLine1>
          <a:PhysicalAddressLine2>19 GISELA RD</a:PhysicalAddressLine2>
          <a:PhysicalAddressSuburb>Goldwater</a:PhysicalAddressSuburb>
          <a:PhysicalCountry />
          <a:PhysicalProvince>Eastern Cape</a:PhysicalProvince>
          <a:PostalAddressCity>Benoni</a:PostalAddressCity>
          <a:PostalAddressCode>1922</a:PostalAddressCode>
          <a:PostalAddressLine1></a:PostalAddressLine1>
          <a:PostalAddressLine2>21 Andrew Avenue</a:PostalAddressLine2>
          <a:PostalAddressSuburb>Benoni</a:PostalAddressSuburb>
          <a:PostalCodeWork>1922</a:PostalCodeWork>
          <a:PostalCountry />
          <a:PostalProvince>Gauteng</a:PostalProvince>
          <a:PreferredContactDelivery>EMAIL</a:PreferredContactDelivery>
          <a:PreferredName>Samuel Frederick</a:PreferredName>
          <a:PreviousEmployerName />
          <a:PreviousEmployerPeriod />
          <a:RelationshipType />
          <a:SACitizen>true</a:SACitizen>
          <a:SAHLDeclaration>false</a:SAHLDeclaration>
          <a:SAHLHighestQualification>MATRIC</a:SAHLHighestQualification>
          <a:SAHLIsSurety>false</a:SAHLIsSurety>
          <a:SAHLSACitizenType>SA CITIZEN</a:SAHLSACitizenType>
          <a:Surname>Sawyer</a:Surname>
          <a:Title>Mr</a:Title>
          <a:WorkPhone>2554000</a:WorkPhone>
          <a:WorkPhoneCode>011</a:WorkPhoneCode>
          <a:Spouse i:nil="true" />
        </a:MainApplicant>
        <a:NamePropertyRegistered>C J Muller</a:NamePropertyRegistered>
        <a:OffPlanIndicator>false</a:OffPlanIndicator>
        <a:OutstandingLoan>0</a:OutstandingLoan>
        <a:ProductSelection>New Variable Loan</a:ProductSelection>
        <a:Property>
          <a:AddressCity>Sandton</a:AddressCity>
          <a:AddressSuburb>Morningside</a:AddressSuburb>
          <a:ComplexName></a:ComplexName>
          <a:ContactCellphone>0312029876</a:ContactCellphone>
          <a:ContactName>PAM GOLDING</a:ContactName>
          <a:PortionNo>0</a:PortionNo>
          <a:PostalCode>1501</a:PostalCode>
          <a:Province>GAUTENG</a:Province>
          <a:SellerIDNo />
          <a:StandErfNo>36</a:StandErfNo>
          <a:StreetName>Marc Drift Avenue</a:StreetName>
          <a:StreetNo>256</a:StreetNo>
          <a:UsePropertyAddressAsDomiciliumAddress>true</a:UsePropertyAddressAsDomiciliumAddress>
          <a:UsePropertyAddressAsLoanMailingAddress>true</a:UsePropertyAddressAsLoanMailingAddress>
        </a:Property>
        <a:PropertyMarketValue>2000000</a:PropertyMarketValue>
        <a:PropertyPurchasePrice>2000000</a:PropertyPurchasePrice>
        <a:QuickCashIndicator>false</a:QuickCashIndicator>
        <a:SAHLBondAccountNo>0</a:SAHLBondAccountNo>
        <a:SAHLOccupancyType>Owner Occupied</a:SAHLOccupancyType>
        <a:SAHLPropertyType>House</a:SAHLPropertyType>
        <a:SAHLTitleType>Freehold</a:SAHLTitleType>
        <a:SAHLVendorCode>SAHL1</a:SAHLVendorCode>
        <a:SahlLoanPurpose>New Purchase Loan</a:SahlLoanPurpose>
        <a:SahlTransferAtt>Velile Tinto</a:SahlTransferAtt>
        <a:SectionalTitleUnitNo>5</a:SectionalTitleUnitNo>
        <a:TermOfLoan>20</a:TermOfLoan>
        <a:TotalEstLoan>0</a:TotalEstLoan>
      </Application>
    </SAHLRequest>
  </s:Body>
</s:Envelope>